; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	thermograph3 - mode
	thermograph2 - mode
	thermograph1 - mode
	image0 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Planet22 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star19)
	(supports instrument5 thermograph3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star0)
	(supports instrument6 thermograph1)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet4)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation3)
	(supports instrument10 thermograph3)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph3)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 Star0)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation2)
	(supports instrument13 image0)
	(calibration_target instrument13 GroundStation3)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet10)
)
(:goal (and
	(pointing satellite2 Phenomenon13)
	(pointing satellite3 Phenomenon14)
	(have_image Planet4 image0)
	(have_image Planet5 thermograph3)
	(have_image Star6 image0)
	(have_image Star7 thermograph3)
	(have_image Planet8 image0)
	(have_image Planet10 thermograph3)
	(have_image Star11 thermograph1)
	(have_image Star12 image0)
	(have_image Phenomenon13 thermograph2)
	(have_image Phenomenon14 thermograph3)
	(have_image Star15 thermograph2)
	(have_image Planet16 image0)
	(have_image Phenomenon17 thermograph2)
	(have_image Phenomenon18 thermograph3)
	(have_image Star19 thermograph2)
	(have_image Planet20 thermograph2)
	(have_image Planet21 thermograph1)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 19
2. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 19
3. (turn_to satellite4 star0 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star0)
   goals met: 0 of 19
4. (calibrate satellite4 instrument11 star0)
   added: (calibrated instrument11)
   goals met: 0 of 19
5. (turn_to satellite4 phenomenon13 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 19
6. (take_image satellite4 phenomenon13 instrument11 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 1 of 19
7. (turn_to satellite4 phenomenon14 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon14)
   goals met: 1 of 19
8. (take_image satellite4 phenomenon14 instrument11 thermograph3)
   added: (have_image phenomenon14 thermograph3)
   goals met: 2 of 19
9. (turn_to satellite4 phenomenon17 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon17)
   goals met: 2 of 19
10. (take_image satellite4 phenomenon17 instrument11 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 3 of 19
11. (turn_to satellite4 phenomenon18 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon18)
   goals met: 3 of 19
12. (take_image satellite4 phenomenon18 instrument11 thermograph3)
   added: (have_image phenomenon18 thermograph3)
   goals met: 4 of 19
13. (turn_to satellite4 planet10 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 planet10)
   goals met: 4 of 19
14. (take_image satellite4 planet10 instrument11 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 5 of 19
15. (turn_to satellite4 planet20 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet20)
   goals met: 5 of 19
16. (take_image satellite4 planet20 instrument11 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 6 of 19
17. (turn_to satellite4 planet21 planet20)
   deleted: (pointing satellite4 planet20)
   added: (pointing satellite4 planet21)
   goals met: 6 of 19
18. (take_image satellite4 planet21 instrument11 thermograph1)
   added: (have_image planet21 thermograph1)
   goals met: 7 of 19
19. (turn_to satellite4 planet5 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet5)
   goals met: 7 of 19
20. (take_image satellite4 planet5 instrument11 thermograph3)
   added: (have_image planet5 thermograph3)
   goals met: 8 of 19
21. (turn_to satellite4 star11 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star11)
   goals met: 8 of 19
22. (take_image satellite4 star11 instrument11 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 9 of 19
23. (turn_to satellite4 star15 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star15)
   goals met: 9 of 19
24. (take_image satellite4 star15 instrument11 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 10 of 19
25. (turn_to satellite4 star19 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star19)
   goals met: 10 of 19
26. (take_image satellite4 star19 instrument11 thermograph2)
   added: (have_image star19 thermograph2)
   goals met: 11 of 19
27. (turn_to satellite4 star7 star19)
   deleted: (pointing satellite4 star19)
   added: (pointing satellite4 star7)
   goals met: 11 of 19
28. (take_image satellite4 star7 instrument11 thermograph3)
   added: (have_image star7 thermograph3)
   goals met: 12 of 19
29. (turn_to satellite3 groundstation3 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation3)
   goals met: 12 of 19
30. (calibrate satellite3 instrument9 groundstation3)
   added: (calibrated instrument9)
   goals met: 12 of 19
31. (turn_to satellite3 phenomenon14 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon14)
   goals met: 13 of 19
32. (turn_to satellite2 phenomenon13 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 phenomenon13)
   goals met: 14 of 19
33. (turn_to satellite3 planet16 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet16)
   goals met: 13 of 19
34. (take_image satellite3 planet16 instrument9 image0)
   added: (have_image planet16 image0)
   goals met: 14 of 19
35. (turn_to satellite3 phenomenon14 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 phenomenon14)
   goals met: 15 of 19
36. (turn_to satellite3 planet4 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet4)
   goals met: 14 of 19
37. (take_image satellite3 planet4 instrument9 image0)
   added: (have_image planet4 image0)
   goals met: 15 of 19
38. (turn_to satellite3 phenomenon14 planet4)
   deleted: (pointing satellite3 planet4)
   added: (pointing satellite3 phenomenon14)
   goals met: 16 of 19
39. (turn_to satellite3 planet8 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet8)
   goals met: 15 of 19
40. (take_image satellite3 planet8 instrument9 image0)
   added: (have_image planet8 image0)
   goals met: 16 of 19
41. (turn_to satellite3 phenomenon14 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 phenomenon14)
   goals met: 17 of 19
42. (turn_to satellite3 star12 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star12)
   goals met: 16 of 19
43. (take_image satellite3 star12 instrument9 image0)
   added: (have_image star12 image0)
   goals met: 17 of 19
44. (turn_to satellite3 phenomenon14 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 phenomenon14)
   goals met: 18 of 19
45. (turn_to satellite3 star6 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 star6)
   goals met: 17 of 19
46. (take_image satellite3 star6 instrument9 image0)
   added: (have_image star6 image0)
   goals met: 18 of 19
47. (turn_to satellite3 phenomenon14 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 phenomenon14)
   goals met: 19 of 19
